App/DataProcessors/АРМДиспетчера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АРМДиспетчера</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

App/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданКурьеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

App/DataProcessors/АРМДиспетчера/Forms/Форма/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// АРМ диспетчера: единое рабочее место для управления доставкой.
//
// Верхняя зона - заказы в работе (новые, готовятся, переданы курьеру).
// Нижняя зона - курьеры со статусом, типом транспорта и количеством заказов в очереди.
// Панель отбора (ресторан, статус, курьер) сужает список заказов.
//
// Диспетчер назначает курьера в один клик, не открывая карточку заказа:
// заказ переводится в статус «Передан курьеру», курьер - в статус «Занят».
// Отметка о доставке фиксирует фактическое время и освобождает курьера.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Заказы в работе отобраны в тексте запроса списка; здесь устанавливается
	// только отбор панели фильтров, чтобы диспетчер видел сохранённые настройки.
	УстановитьОтборСпискаЗаказовНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ФильтрРесторанПриИзменении(Элемент)
	ПрименитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусПриИзменении(Элемент)
	ПрименитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрКурьерПриИзменении(Элемент)
	ПрименитьОтбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НазначитьКурьера(Команда)

	Заказ = ТекущийЗаказ();
	Если Заказ = Неопределено Тогда
		ПоказатьПояснение(НСтр("ru = 'Выберите заказ в списке заказов.'"));
		Возврат;
	КонецЕсли;

	Курьер = ТекущийКурьер();
	Если Курьер = Неопределено Тогда
		ПоказатьПояснение(НСтр("ru = 'Выберите курьера в списке курьеров.'"));
		Возврат;
	КонецЕсли;

	НазначитьКурьераНаСервере(Заказ.Ссылка, Курьер.Ссылка);
	ПеречитатьСписки();

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьДоставленным(Команда)

	Заказ = ТекущийЗаказ();
	Если Заказ = Неопределено Тогда
		ПоказатьПояснение(НСтр("ru = 'Выберите заказ в списке заказов.'"));
		Возврат;
	КонецЕсли;

	ОтметитьДоставленнымНаСервере(Заказ.Ссылка);
	ПеречитатьСписки();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки(Команда)
	ПеречитатьСписки();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьФильтры(Команда)
	ПрименитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СброситьФильтры(Команда)

	ФильтрРесторан = Справочники.Рестораны.ПустаяСсылка;
	ФильтрСтатус   = Перечисления.СтатусыЗаказов.ПустаяСсылка;
	ФильтрКурьер   = Справочники.Курьеры.ПустаяСсылка;

	ПрименитьОтбор();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Клиент

&НаКлиенте
Процедура ПрименитьОтбор()

	УстановитьОтборСпискаЗаказовНаСервере();
	ПеречитатьСписки();

КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьСписки()

	Элементы.СписокЗаказов.Обновить();
	Элементы.СписокКурьеров.Обновить();

КонецПроцедуры

&НаКлиенте
Функция ТекущийЗаказ()

	Возврат Элементы.СписокЗаказов.ТекущиеДанные;

КонецФункции

&НаКлиенте
Функция ТекущийКурьер()

	СтрокаКурьера = Элементы.СписокКурьеров.ТекущиеДанные;
	Если СтрокаКурьера <> Неопределено Тогда
		Возврат СтрокаКурьера;
	КонецЕсли;

	// Строка в списке курьеров не выбрана - берём курьера из панели отбора.
	Если ЗначениеЗаполнено(ФильтрКурьер) Тогда
		Возврат Новый Структура("Ссылка", ФильтрКурьер);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура ПоказатьПояснение(ТекстПояснения)

	// Модальность в конфигурации запрещена, поэтому используется немодальное предупреждение.
	ПоказатьПредупреждение(Неопределено, ТекстПояснения, 5);

КонецПроцедуры

#КонецОбласти

#Область Сервер

&НаСервере
Процедура УстановитьОтборСпискаЗаказовНаСервере()

	ЭлементыОтбора = СписокЗаказов.Отбор.Элементы;
	ЭлементыОтбора.Очистить();

	ДобавитьЭлементОтбора(ЭлементыОтбора, "Ресторан", ФильтрРесторан);
	ДобавитьЭлементОтбора(ЭлементыОтбора, "Статус", ФильтрСтатус);
	ДобавитьЭлементОтбора(ЭлементыОтбора, "Курьер", ФильтрКурьер);

КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементОтбора(ЭлементыОтбора, ИмяПоля, ЗначениеОтбора)

	Если Не ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		Возврат;
	КонецЕсли;

	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;

КонецПроцедуры

&НаСервере
Процедура НазначитьКурьераНаСервере(ЗаказСсылка, КурьерСсылка)

	Попытка
		УправлениеДоставкой.НазначитьКурьераНаЗаказ(ЗаказСсылка, КурьерСсылка);
	Исключение
		СообщитьОбОшибке(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;

	СообщитьРезультат(СтрШаблон(
		НСтр("ru = 'Заказ %1 передан курьеру %2. Статус заказа - ""Передан курьеру"".'"),
		Строка(ЗаказСсылка), Строка(КурьерСсылка)));

КонецПроцедуры

&НаСервере
Процедура ОтметитьДоставленнымНаСервере(ЗаказСсылка)

	Попытка

		ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
		Если ЗаказОбъект = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Заказ не найден.'");
		КонецЕсли;

		ЗаказОбъект.Статус = Перечисления.СтатусыЗаказов.Доставлен;
		ЗаказОбъект.Записать();

		// Если при записи сработал отказ (не заполнены клиент, ресторан или состав),
		// статус в базе не меняется - сообщаем диспетчеру, а не рапортуем об успехе.
		Если ЗаказСсылка.Статус <> Перечисления.СтатусыЗаказов.Доставлен Тогда
			ВызватьИсключение НСтр("ru = 'Заказ не переведен в статус ""Доставлен"". Проверьте заполнение клиента, ресторана и состава заказа.'");
		КонецЕсли;

		ТекстРезультата = СтрШаблон(
			НСтр("ru = 'Заказ %1 доставлен. Время доставки: %2 мин.'"),
			Строка(ЗаказОбъект.Ссылка),
			Формат(ЗаказОбъект.ВремяДоставкиМинут, "ЧДЦ=0"));

		Если ЗначениеЗаполнено(ЗаказОбъект.Курьер) Тогда

			// Статус курьера пересчитан при записи заказа, поэтому берём
			// количество заказов в очереди свежим запросом.
			ЗаказовВОчереди = УправлениеДоставкой.КоличествоЗаказовВОчереди(ЗаказОбъект.Курьер);

			Если ЗаказовВОчереди = 0 Тогда
				ТекстРезультата = ТекстРезультата + СтрШаблон(
					НСтр("ru = ' Курьер %1 свободен и может принять новый заказ.'"),
					Строка(ЗаказОбъект.Курьер));
			Иначе
				ТекстРезультата = ТекстРезультата + СтрШаблон(
					НСтр("ru = ' У курьера %1 в очереди осталось заказов: %2.'"),
					Строка(ЗаказОбъект.Курьер), ЗаказовВОчереди);
			КонецЕсли;

		КонецЕсли;

	Исключение

		СообщитьОбОшибке(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;

	КонецПопытки;

	СообщитьРезультат(ТекстРезультата);

КонецПроцедуры

&НаСервере
Процедура СообщитьРезультат(ТекстСообщения)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Статус = СтатусСообщения.Информация;
	Сообщение.Сообщить();

КонецПроцедуры

&НаСервере
Процедура СообщитьОбОшибке(ТекстСообщения)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Статус = СтатусСообщения.Важное;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти

#КонецОбласти
